#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "dev-network"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.subnet will be created
  + resource "google_compute_subnetwork" "subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.0.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-a"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = "true"
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = (known after apply)
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "192.168.0.0/16"
              + range_name    = "services-range"
            },
          + {
              + ip_cidr_range = "172.16.0.0/16"
              + range_name    = "pod-ranges"
            },
        ]
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-west1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "builds-334818-gke"
      + network                     = "dev-network"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "subnet-a"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = (known after apply)

          + auto_provisioning_defaults {
              + image_type      = (known after apply)
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "services-range"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "pod-ranges"
        }

      + logging_config {
          + enable_components = (known after apply)
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + monitoring_config {
          + enable_components = (known after apply)
        }

      + network_policy {
          + enabled = true
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + node_pool {
          + initial_node_count          = (known after apply)
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = (known after apply)
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + node_group        = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + gvnic {
                  + enabled = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "10.0.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = true
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + vertical_pod_autoscaling {
          + enabled = (known after apply)
        }

      + workload_identity_config {
          + workload_pool = "builds-334818.svc.id.goog"
        }
    }

  # google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "builds-334818-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-west1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "builds-334818-gke-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + management {
          + auto_repair  = (known after apply)
          + auto_upgrade = (known after apply)
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "builds-334818"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + tags              = [
              + "gke-node",
              + "builds-334818-gke",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

#### Checkov Results :mag_right:`success`

<details><summary>Show Checkov Results</summary>

```


       _               _              
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V / 
  \___|_| |_|\___|\___|_|\_\___/ \_/  
                                      
By bridgecrew.io | version: 2.0.1047 
terraform scan results:

Passed checks: 14, Failed checks: 15, Skipped checks: 2

Check: CKV_GCP_74: "Ensure that private_ip_google_access is enabled for Subnet"
	PASSED for resource: google_compute_subnetwork.subnet
	File: /main.tf:6-22
Check: CKV_GCP_76: "Ensure that Private google access is enabled for IPV6"
	PASSED for resource: google_compute_subnetwork.subnet
	File: /main.tf:6-22
Check: CKV_GCP_8: "Ensure Stackdriver Monitoring is set to Enabled on Kubernetes Engine Clusters"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_3
Check: CKV_GCP_69: "Ensure the GKE Metadata Server is Enabled"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/ensure-the-gke-metadata-server-is-enabled
Check: CKV_GCP_1: "Ensure Stackdriver Logging is set to Enabled on Kubernetes Engine Clusters"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_1
Check: CKV_GCP_12: "Ensure Network Policy is enabled on Kubernetes Engine Clusters"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_7
Check: CKV_GCP_72: "Ensure Integrity Monitoring for Shielded GKE Nodes is Enabled"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/ensure-integrity-monitoring-for-shielded-gke-nodes-is-enabled
Check: CKV_GCP_71: "Ensure Shielded GKE Nodes are Enabled"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/ensure-shielded-gke-nodes-are-enabled
Check: CKV_GCP_23: "Ensure Kubernetes Cluster is created with Alias IP ranges enabled"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_15
Check: CKV_GCP_18: "Ensure GKE Control Plane is not public"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_10
Check: CKV_GCP_64: "Ensure clusters are created with Private Nodes"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/ensure-clusters-are-created-with-private-nodes
Check: CKV_GCP_25: "Ensure Kubernetes Cluster is created with Private cluster enabled"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_6
Check: CKV_GCP_7: "Ensure Legacy Authorization is set to Disabled on Kubernetes Engine Clusters"
	PASSED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_2
Check: CKV_GCP_72: "Ensure Integrity Monitoring for Shielded GKE Nodes is Enabled"
	PASSED for resource: google_container_node_pool.primary_nodes
	File: /main.tf:67-90
	Guide: https://docs.bridgecrew.io/docs/ensure-integrity-monitoring-for-shielded-gke-nodes-is-enabled
Check: CKV_GCP_65: "Manage Kubernetes RBAC users with Google Groups for GKE"
	FAILED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/manage-kubernetes-rbac-users-with-google-groups-for-gke

		24 | resource "google_container_cluster" "primary" {
		25 |   #checkov:skip=CKV_GCP_13:Leaving this enabled for ArgoCD Auth
		26 |   name     = "${var.project}-gke"
		27 |   location = var.region
		28 | 
		29 |   remove_default_node_pool = true
		30 |   initial_node_count       = 1
		31 | 
		32 |   network    = google_compute_network.vpc.name
		33 |   subnetwork = google_compute_subnetwork.subnet.name
		34 | 
		35 |   ip_allocation_policy {
		36 |     cluster_secondary_range_name  = google_compute_subnetwork.subnet.secondary_ip_range.0.range_name
		37 |     services_secondary_range_name = google_compute_subnetwork.subnet.secondary_ip_range.1.range_name
		38 |   }
		39 | 
		40 |   private_cluster_config {
		41 |     enable_private_nodes    = true
		42 |     enable_private_endpoint = false
		43 |     master_ipv4_cidr_block  = "10.0.0.0/28"
		44 |     master_global_access_config {
		45 |       enabled = true
		46 |     }
		47 |   }
		48 | 
		49 |   workload_identity_config {
		50 |     workload_pool = "${var.project}.svc.id.goog"
		51 |   }
		52 | 
		53 |   network_policy {
		54 |     enabled = true
		55 |   }
		56 | 
		57 |   enable_shielded_nodes = true
		58 | 
		59 | 
		60 |   node_config {
		61 |     workload_metadata_config {
		62 |       mode = "GKE_METADATA"
		63 |     }
		64 |   }
		65 | }

Check: CKV_GCP_24: "Ensure PodSecurityPolicy controller is enabled on the Kubernetes Engine Clusters"
	FAILED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_9

		24 | resource "google_container_cluster" "primary" {
		25 |   #checkov:skip=CKV_GCP_13:Leaving this enabled for ArgoCD Auth
		26 |   name     = "${var.project}-gke"
		27 |   location = var.region
		28 | 
		29 |   remove_default_node_pool = true
		30 |   initial_node_count       = 1
		31 | 
		32 |   network    = google_compute_network.vpc.name
		33 |   subnetwork = google_compute_subnetwork.subnet.name
		34 | 
		35 |   ip_allocation_policy {
		36 |     cluster_secondary_range_name  = google_compute_subnetwork.subnet.secondary_ip_range.0.range_name
		37 |     services_secondary_range_name = google_compute_subnetwork.subnet.secondary_ip_range.1.range_name
		38 |   }
		39 | 
		40 |   private_cluster_config {
		41 |     enable_private_nodes    = true
		42 |     enable_private_endpoint = false
		43 |     master_ipv4_cidr_block  = "10.0.0.0/28"
		44 |     master_global_access_config {
		45 |       enabled = true
		46 |     }
		47 |   }
		48 | 
		49 |   workload_identity_config {
		50 |     workload_pool = "${var.project}.svc.id.goog"
		51 |   }
		52 | 
		53 |   network_policy {
		54 |     enabled = true
		55 |   }
		56 | 
		57 |   enable_shielded_nodes = true
		58 | 
		59 | 
		60 |   node_config {
		61 |     workload_metadata_config {
		62 |       mode = "GKE_METADATA"
		63 |     }
		64 |   }
		65 | }

Check: CKV_GCP_21: "Ensure Kubernetes Clusters are configured with Labels"
	FAILED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_13

		24 | resource "google_container_cluster" "primary" {
		25 |   #checkov:skip=CKV_GCP_13:Leaving this enabled for ArgoCD Auth
		26 |   name     = "${var.project}-gke"
		27 |   location = var.region
		28 | 
		29 |   remove_default_node_pool = true
		30 |   initial_node_count       = 1
		31 | 
		32 |   network    = google_compute_network.vpc.name
		33 |   subnetwork = google_compute_subnetwork.subnet.name
		34 | 
		35 |   ip_allocation_policy {
		36 |     cluster_secondary_range_name  = google_compute_subnetwork.subnet.secondary_ip_range.0.range_name
		37 |     services_secondary_range_name = google_compute_subnetwork.subnet.secondary_ip_range.1.range_name
		38 |   }
		39 | 
		40 |   private_cluster_config {
		41 |     enable_private_nodes    = true
		42 |     enable_private_endpoint = false
		43 |     master_ipv4_cidr_block  = "10.0.0.0/28"
		44 |     master_global_access_config {
		45 |       enabled = true
		46 |     }
		47 |   }
		48 | 
		49 |   workload_identity_config {
		50 |     workload_pool = "${var.project}.svc.id.goog"
		51 |   }
		52 | 
		53 |   network_policy {
		54 |     enabled = true
		55 |   }
		56 | 
		57 |   enable_shielded_nodes = true
		58 | 
		59 | 
		60 |   node_config {
		61 |     workload_metadata_config {
		62 |       mode = "GKE_METADATA"
		63 |     }
		64 |   }
		65 | }

Check: CKV_GCP_66: "Ensure use of Binary Authorization"
	FAILED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/ensure-use-of-binary-authorization

		24 | resource "google_container_cluster" "primary" {
		25 |   #checkov:skip=CKV_GCP_13:Leaving this enabled for ArgoCD Auth
		26 |   name     = "${var.project}-gke"
		27 |   location = var.region
		28 | 
		29 |   remove_default_node_pool = true
		30 |   initial_node_count       = 1
		31 | 
		32 |   network    = google_compute_network.vpc.name
		33 |   subnetwork = google_compute_subnetwork.subnet.name
		34 | 
		35 |   ip_allocation_policy {
		36 |     cluster_secondary_range_name  = google_compute_subnetwork.subnet.secondary_ip_range.0.range_name
		37 |     services_secondary_range_name = google_compute_subnetwork.subnet.secondary_ip_range.1.range_name
		38 |   }
		39 | 
		40 |   private_cluster_config {
		41 |     enable_private_nodes    = true
		42 |     enable_private_endpoint = false
		43 |     master_ipv4_cidr_block  = "10.0.0.0/28"
		44 |     master_global_access_config {
		45 |       enabled = true
		46 |     }
		47 |   }
		48 | 
		49 |   workload_identity_config {
		50 |     workload_pool = "${var.project}.svc.id.goog"
		51 |   }
		52 | 
		53 |   network_policy {
		54 |     enabled = true
		55 |   }
		56 | 
		57 |   enable_shielded_nodes = true
		58 | 
		59 | 
		60 |   node_config {
		61 |     workload_metadata_config {
		62 |       mode = "GKE_METADATA"
		63 |     }
		64 |   }
		65 | }

Check: CKV_GCP_19: "Ensure GKE basic auth is disabled"
	FAILED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_11

		24 | resource "google_container_cluster" "primary" {
		25 |   #checkov:skip=CKV_GCP_13:Leaving this enabled for ArgoCD Auth
		26 |   name     = "${var.project}-gke"
		27 |   location = var.region
		28 | 
		29 |   remove_default_node_pool = true
		30 |   initial_node_count       = 1
		31 | 
		32 |   network    = google_compute_network.vpc.name
		33 |   subnetwork = google_compute_subnetwork.subnet.name
		34 | 
		35 |   ip_allocation_policy {
		36 |     cluster_secondary_range_name  = google_compute_subnetwork.subnet.secondary_ip_range.0.range_name
		37 |     services_secondary_range_name = google_compute_subnetwork.subnet.secondary_ip_range.1.range_name
		38 |   }
		39 | 
		40 |   private_cluster_config {
		41 |     enable_private_nodes    = true
		42 |     enable_private_endpoint = false
		43 |     master_ipv4_cidr_block  = "10.0.0.0/28"
		44 |     master_global_access_config {
		45 |       enabled = true
		46 |     }
		47 |   }
		48 | 
		49 |   workload_identity_config {
		50 |     workload_pool = "${var.project}.svc.id.goog"
		51 |   }
		52 | 
		53 |   network_policy {
		54 |     enabled = true
		55 |   }
		56 | 
		57 |   enable_shielded_nodes = true
		58 | 
		59 | 
		60 |   node_config {
		61 |     workload_metadata_config {
		62 |       mode = "GKE_METADATA"
		63 |     }
		64 |   }
		65 | }

Check: CKV_GCP_20: "Ensure master authorized networks is set to enabled in GKE clusters"
	FAILED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_12

		24 | resource "google_container_cluster" "primary" {
		25 |   #checkov:skip=CKV_GCP_13:Leaving this enabled for ArgoCD Auth
		26 |   name     = "${var.project}-gke"
		27 |   location = var.region
		28 | 
		29 |   remove_default_node_pool = true
		30 |   initial_node_count       = 1
		31 | 
		32 |   network    = google_compute_network.vpc.name
		33 |   subnetwork = google_compute_subnetwork.subnet.name
		34 | 
		35 |   ip_allocation_policy {
		36 |     cluster_secondary_range_name  = google_compute_subnetwork.subnet.secondary_ip_range.0.range_name
		37 |     services_secondary_range_name = google_compute_subnetwork.subnet.secondary_ip_range.1.range_name
		38 |   }
		39 | 
		40 |   private_cluster_config {
		41 |     enable_private_nodes    = true
		42 |     enable_private_endpoint = false
		43 |     master_ipv4_cidr_block  = "10.0.0.0/28"
		44 |     master_global_access_config {
		45 |       enabled = true
		46 |     }
		47 |   }
		48 | 
		49 |   workload_identity_config {
		50 |     workload_pool = "${var.project}.svc.id.goog"
		51 |   }
		52 | 
		53 |   network_policy {
		54 |     enabled = true
		55 |   }
		56 | 
		57 |   enable_shielded_nodes = true
		58 | 
		59 | 
		60 |   node_config {
		61 |     workload_metadata_config {
		62 |       mode = "GKE_METADATA"
		63 |     }
		64 |   }
		65 | }

Check: CKV_GCP_61: "Enable VPC Flow Logs and Intranode Visibility"
	FAILED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/enable-vpc-flow-logs-and-intranode-visibility

		24 | resource "google_container_cluster" "primary" {
		25 |   #checkov:skip=CKV_GCP_13:Leaving this enabled for ArgoCD Auth
		26 |   name     = "${var.project}-gke"
		27 |   location = var.region
		28 | 
		29 |   remove_default_node_pool = true
		30 |   initial_node_count       = 1
		31 | 
		32 |   network    = google_compute_network.vpc.name
		33 |   subnetwork = google_compute_subnetwork.subnet.name
		34 | 
		35 |   ip_allocation_policy {
		36 |     cluster_secondary_range_name  = google_compute_subnetwork.subnet.secondary_ip_range.0.range_name
		37 |     services_secondary_range_name = google_compute_subnetwork.subnet.secondary_ip_range.1.range_name
		38 |   }
		39 | 
		40 |   private_cluster_config {
		41 |     enable_private_nodes    = true
		42 |     enable_private_endpoint = false
		43 |     master_ipv4_cidr_block  = "10.0.0.0/28"
		44 |     master_global_access_config {
		45 |       enabled = true
		46 |     }
		47 |   }
		48 | 
		49 |   workload_identity_config {
		50 |     workload_pool = "${var.project}.svc.id.goog"
		51 |   }
		52 | 
		53 |   network_policy {
		54 |     enabled = true
		55 |   }
		56 | 
		57 |   enable_shielded_nodes = true
		58 | 
		59 | 
		60 |   node_config {
		61 |     workload_metadata_config {
		62 |       mode = "GKE_METADATA"
		63 |     }
		64 |   }
		65 | }

Check: CKV_GCP_70: "Ensure the GKE Release Channel is set"
	FAILED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/ensure-the-gke-release-channel-is-set

		24 | resource "google_container_cluster" "primary" {
		25 |   #checkov:skip=CKV_GCP_13:Leaving this enabled for ArgoCD Auth
		26 |   name     = "${var.project}-gke"
		27 |   location = var.region
		28 | 
		29 |   remove_default_node_pool = true
		30 |   initial_node_count       = 1
		31 | 
		32 |   network    = google_compute_network.vpc.name
		33 |   subnetwork = google_compute_subnetwork.subnet.name
		34 | 
		35 |   ip_allocation_policy {
		36 |     cluster_secondary_range_name  = google_compute_subnetwork.subnet.secondary_ip_range.0.range_name
		37 |     services_secondary_range_name = google_compute_subnetwork.subnet.secondary_ip_range.1.range_name
		38 |   }
		39 | 
		40 |   private_cluster_config {
		41 |     enable_private_nodes    = true
		42 |     enable_private_endpoint = false
		43 |     master_ipv4_cidr_block  = "10.0.0.0/28"
		44 |     master_global_access_config {
		45 |       enabled = true
		46 |     }
		47 |   }
		48 | 
		49 |   workload_identity_config {
		50 |     workload_pool = "${var.project}.svc.id.goog"
		51 |   }
		52 | 
		53 |   network_policy {
		54 |     enabled = true
		55 |   }
		56 | 
		57 |   enable_shielded_nodes = true
		58 | 
		59 | 
		60 |   node_config {
		61 |     workload_metadata_config {
		62 |       mode = "GKE_METADATA"
		63 |     }
		64 |   }
		65 | }

Check: CKV_GCP_68: "Ensure Secure Boot for Shielded GKE Nodes is Enabled"
	FAILED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/ensure-secure-boot-for-shielded-gke-nodes-is-enabled

		24 | resource "google_container_cluster" "primary" {
		25 |   #checkov:skip=CKV_GCP_13:Leaving this enabled for ArgoCD Auth
		26 |   name     = "${var.project}-gke"
		27 |   location = var.region
		28 | 
		29 |   remove_default_node_pool = true
		30 |   initial_node_count       = 1
		31 | 
		32 |   network    = google_compute_network.vpc.name
		33 |   subnetwork = google_compute_subnetwork.subnet.name
		34 | 
		35 |   ip_allocation_policy {
		36 |     cluster_secondary_range_name  = google_compute_subnetwork.subnet.secondary_ip_range.0.range_name
		37 |     services_secondary_range_name = google_compute_subnetwork.subnet.secondary_ip_range.1.range_name
		38 |   }
		39 | 
		40 |   private_cluster_config {
		41 |     enable_private_nodes    = true
		42 |     enable_private_endpoint = false
		43 |     master_ipv4_cidr_block  = "10.0.0.0/28"
		44 |     master_global_access_config {
		45 |       enabled = true
		46 |     }
		47 |   }
		48 | 
		49 |   workload_identity_config {
		50 |     workload_pool = "${var.project}.svc.id.goog"
		51 |   }
		52 | 
		53 |   network_policy {
		54 |     enabled = true
		55 |   }
		56 | 
		57 |   enable_shielded_nodes = true
		58 | 
		59 | 
		60 |   node_config {
		61 |     workload_metadata_config {
		62 |       mode = "GKE_METADATA"
		63 |     }
		64 |   }
		65 | }

Check: CKV_GCP_67: "Ensure legacy Compute Engine instance metadata APIs are Disabled"
	FAILED for resource: google_container_cluster.primary
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/ensure-legacy-compute-engine-instance-metadata-apis-are-disabled

		24 | resource "google_container_cluster" "primary" {
		25 |   #checkov:skip=CKV_GCP_13:Leaving this enabled for ArgoCD Auth
		26 |   name     = "${var.project}-gke"
		27 |   location = var.region
		28 | 
		29 |   remove_default_node_pool = true
		30 |   initial_node_count       = 1
		31 | 
		32 |   network    = google_compute_network.vpc.name
		33 |   subnetwork = google_compute_subnetwork.subnet.name
		34 | 
		35 |   ip_allocation_policy {
		36 |     cluster_secondary_range_name  = google_compute_subnetwork.subnet.secondary_ip_range.0.range_name
		37 |     services_secondary_range_name = google_compute_subnetwork.subnet.secondary_ip_range.1.range_name
		38 |   }
		39 | 
		40 |   private_cluster_config {
		41 |     enable_private_nodes    = true
		42 |     enable_private_endpoint = false
		43 |     master_ipv4_cidr_block  = "10.0.0.0/28"
		44 |     master_global_access_config {
		45 |       enabled = true
		46 |     }
		47 |   }
		48 | 
		49 |   workload_identity_config {
		50 |     workload_pool = "${var.project}.svc.id.goog"
		51 |   }
		52 | 
		53 |   network_policy {
		54 |     enabled = true
		55 |   }
		56 | 
		57 |   enable_shielded_nodes = true
		58 | 
		59 | 
		60 |   node_config {
		61 |     workload_metadata_config {
		62 |       mode = "GKE_METADATA"
		63 |     }
		64 |   }
		65 | }

Check: CKV_GCP_69: "Ensure the GKE Metadata Server is Enabled"
	FAILED for resource: google_container_node_pool.primary_nodes
	File: /main.tf:67-90
	Guide: https://docs.bridgecrew.io/docs/ensure-the-gke-metadata-server-is-enabled

		67 | resource "google_container_node_pool" "primary_nodes" {
		68 |   name       = "${google_container_cluster.primary.name}-node-pool"
		69 |   location   = var.region
		70 |   cluster    = google_container_cluster.primary.name
		71 |   node_count = 1
		72 | 
		73 |   node_config {
		74 |     oauth_scopes = [
		75 |       "https://www.googleapis.com/auth/logging.write",
		76 |       "https://www.googleapis.com/auth/monitoring",
		77 |     ]
		78 | 
		79 |     labels = {
		80 |       env = var.project
		81 |     }
		82 | 
		83 |     preemptible  = true
		84 |     machine_type = "n1-standard-1"
		85 |     tags         = ["gke-node", "${var.project}-gke"]
		86 |     metadata = {
		87 |       disable-legacy-endpoints = "true"
		88 |     }
		89 |   }
		90 | }

Check: CKV_GCP_10: "Ensure 'Automatic node upgrade' is enabled for Kubernetes Clusters"
	FAILED for resource: google_container_node_pool.primary_nodes
	File: /main.tf:67-90
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_5

		67 | resource "google_container_node_pool" "primary_nodes" {
		68 |   name       = "${google_container_cluster.primary.name}-node-pool"
		69 |   location   = var.region
		70 |   cluster    = google_container_cluster.primary.name
		71 |   node_count = 1
		72 | 
		73 |   node_config {
		74 |     oauth_scopes = [
		75 |       "https://www.googleapis.com/auth/logging.write",
		76 |       "https://www.googleapis.com/auth/monitoring",
		77 |     ]
		78 | 
		79 |     labels = {
		80 |       env = var.project
		81 |     }
		82 | 
		83 |     preemptible  = true
		84 |     machine_type = "n1-standard-1"
		85 |     tags         = ["gke-node", "${var.project}-gke"]
		86 |     metadata = {
		87 |       disable-legacy-endpoints = "true"
		88 |     }
		89 |   }
		90 | }

Check: CKV_GCP_22: "Ensure Container-Optimized OS (cos) is used for Kubernetes Engine Clusters Node image"
	FAILED for resource: google_container_node_pool.primary_nodes
	File: /main.tf:67-90
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_14

		67 | resource "google_container_node_pool" "primary_nodes" {
		68 |   name       = "${google_container_cluster.primary.name}-node-pool"
		69 |   location   = var.region
		70 |   cluster    = google_container_cluster.primary.name
		71 |   node_count = 1
		72 | 
		73 |   node_config {
		74 |     oauth_scopes = [
		75 |       "https://www.googleapis.com/auth/logging.write",
		76 |       "https://www.googleapis.com/auth/monitoring",
		77 |     ]
		78 | 
		79 |     labels = {
		80 |       env = var.project
		81 |     }
		82 | 
		83 |     preemptible  = true
		84 |     machine_type = "n1-standard-1"
		85 |     tags         = ["gke-node", "${var.project}-gke"]
		86 |     metadata = {
		87 |       disable-legacy-endpoints = "true"
		88 |     }
		89 |   }
		90 | }

Check: CKV_GCP_9: "Ensure 'Automatic node repair' is enabled for Kubernetes Clusters"
	FAILED for resource: google_container_node_pool.primary_nodes
	File: /main.tf:67-90
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_4

		67 | resource "google_container_node_pool" "primary_nodes" {
		68 |   name       = "${google_container_cluster.primary.name}-node-pool"
		69 |   location   = var.region
		70 |   cluster    = google_container_cluster.primary.name
		71 |   node_count = 1
		72 | 
		73 |   node_config {
		74 |     oauth_scopes = [
		75 |       "https://www.googleapis.com/auth/logging.write",
		76 |       "https://www.googleapis.com/auth/monitoring",
		77 |     ]
		78 | 
		79 |     labels = {
		80 |       env = var.project
		81 |     }
		82 | 
		83 |     preemptible  = true
		84 |     machine_type = "n1-standard-1"
		85 |     tags         = ["gke-node", "${var.project}-gke"]
		86 |     metadata = {
		87 |       disable-legacy-endpoints = "true"
		88 |     }
		89 |   }
		90 | }

Check: CKV_GCP_68: "Ensure Secure Boot for Shielded GKE Nodes is Enabled"
	FAILED for resource: google_container_node_pool.primary_nodes
	File: /main.tf:67-90
	Guide: https://docs.bridgecrew.io/docs/ensure-secure-boot-for-shielded-gke-nodes-is-enabled

		67 | resource "google_container_node_pool" "primary_nodes" {
		68 |   name       = "${google_container_cluster.primary.name}-node-pool"
		69 |   location   = var.region
		70 |   cluster    = google_container_cluster.primary.name
		71 |   node_count = 1
		72 | 
		73 |   node_config {
		74 |     oauth_scopes = [
		75 |       "https://www.googleapis.com/auth/logging.write",
		76 |       "https://www.googleapis.com/auth/monitoring",
		77 |     ]
		78 | 
		79 |     labels = {
		80 |       env = var.project
		81 |     }
		82 | 
		83 |     preemptible  = true
		84 |     machine_type = "n1-standard-1"
		85 |     tags         = ["gke-node", "${var.project}-gke"]
		86 |     metadata = {
		87 |       disable-legacy-endpoints = "true"
		88 |     }
		89 |   }
		90 | }

Check: CKV_GCP_26: "Ensure that VPC Flow Logs is enabled for every subnet in a VPC Network"
	SKIPPED for resource: google_compute_subnetwork.subnet
	Suppress comment: Intentionally leaving off flow logs for now
	File: /main.tf:6-22
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_logging_1
Check: CKV_GCP_13: "Ensure client certificate authentication to Kubernetes Engine Clusters is disabled"
	SKIPPED for resource: google_container_cluster.primary
	Suppress comment: Leaving this enabled for ArgoCD Auth
	File: /main.tf:24-65
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_8


Wrote output in SARIF format to the file 'results.sarif'
```

</details>

*Pusher: @choste, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*